# Data Frame

In [2]:
# import packages
import pandas as pd
import numpy as np
test = [1,2,3,4,5]
test

[1, 2, 3, 4, 5]

In [2]:
df1 = pd.Series(test)
df1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
df = pd.DataFrame(test)
df

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
## Creating a Table
table = [['srinu', 25],['krishna', 26],['mani',27],['ratna',28]]
table

[['srinu', 25], ['krishna', 26], ['mani', 27], ['ratna', 28]]

In [5]:
df = pd.DataFrame(table,columns=['Name','Age'])
df

      Name  Age
0    srinu   25
1  krishna   26
2     mani   27
3    ratna   28

In [6]:
table1 = {'Name':['srinu','kishore','mani','ratna'],'Age':[25,26,27,28]}
df = pd.DataFrame(table1,index=[1,2,3,4])
df

      Name  Age
1    srinu   25
2  kishore   26
3     mani   27
4    ratna   28

In [7]:
# Columns selection, deletion, addition
df['weight'] = pd.Series([100,101,102,103], index = [1,2,3,4])
df

      Name  Age  weight
1    srinu   25     100
2  kishore   26     101
3     mani   27     102
4    ratna   28     103

In [8]:
df['height'] = pd.Series([150,151,152,153], index = [1,2,3,4])
df

      Name  Age  weight  height
1    srinu   25     100     150
2  kishore   26     101     151
3     mani   27     102     152
4    ratna   28     103     153

In [13]:
# Deleting the column
del df['Age']
df

KeyError: 'Age'

In [12]:
loc.df('mani')

NameError: name 'loc' is not defined

In [17]:
# Other method to delete the column 
# df.pop('one')

In [3]:
# Addition of rows 
df = pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df

   a  b
0  1  2
1  3  4

In [4]:
df2 = pd.DataFrame([[5,6],[7,8]],columns=['a','b'])
df2

   a  b
0  5  6
1  7  8

In [5]:
df = df.append(df2)
df

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [6]:
df2 = df2.append(df)
df2

   a  b
0  5  6
1  7  8
0  1  2
1  3  4
0  5  6
1  7  8

In [8]:
df.loc(mani)

NameError: name 'mani' is not defined

In [22]:
table1 = {'Name':['srinu','kishore','mani','ratna'],'Age':[25,26,27,28]}
df = pd.DataFrame(table1,index=[1,2,3,4])
df

      Name  Age
1    srinu   25
2  kishore   26
3     mani   27
4    ratna   28

In [23]:
df.loc(Age > 25)

NameError: name 'Age' is not defined

In [24]:
df.iloc(1)

In [26]:
df1 = pd.DataFrame({"emp_id":[1,2,3,4], "Name":["A","B","C","D"], "Age":[22,24,25,27]})
df1

   emp_id Name  Age
0       1    A   22
1       2    B   24
2       3    C   25
3       4    D   27

In [29]:
df2 = pd.DataFrame({"emp_id":[1,2,3,4], "Name":["A","B","K","L"], "Weight":[55,58,73,42]})
df2

   emp_id Name  Weight
0       1    A      55
1       2    B      58
2       3    K      73
3       4    L      42

In [30]:
pd.merge(df1, df2)

   emp_id Name  Age  Weight
0       1    A   22      55
1       2    B   24      58

In [31]:
# It merge and add both the tables Nan- Not Applicable 
pd.merge(df1,df2,how="outer")

   emp_id Name   Age  Weight
0       1    A  22.0    55.0
1       2    B  24.0    58.0
2       3    C  25.0     NaN
3       4    D  27.0     NaN
4       3    K   NaN    73.0
5       4    L   NaN    42.0

In [32]:
# It will add based on the name columns
pd.merge(df1,df2,how="outer",on=["Name"])

   emp_id_x Name   Age  emp_id_y  Weight
0       1.0    A  22.0       1.0    55.0
1       2.0    B  24.0       2.0    58.0
2       3.0    C  25.0       NaN     NaN
3       4.0    D  27.0       NaN     NaN
4       NaN    K   NaN       3.0    73.0
5       NaN    L   NaN       4.0    42.0